Revit 2027 API
DuctFittingAndAccessoryPressureDropData Methods
The DuctFittingAndAccessoryPressureDropData type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDuctFittingAndAccessoryData |  Returns the fitting and accessory information.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPresureDropItems |  Returns the pressure drop items.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetDefaultEntity |  Stores the default entity in the data.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace